src/Catalogs/Патчи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Патчи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Релизы</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Релизы</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазовыйНомерРевизии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийШаг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиРаботыСРепозиторием</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БФТ_НастройкаПодключенияКРепозиторию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БылКонфликтСлияния</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛокальныйПутьКСборке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаборыИзменений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаборИзменений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БФТ_НаборыИзменений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВходитВБазовыйНабор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗадачаНеАктуальна</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/БФТ_ИзмененияРепозитория.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>БФТ_ИзмененияРепозитория</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АвторИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипИзменений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БФТ_ТипИзменений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерРевизии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Релизы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Релизы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРелиза</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РелизВыпущен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РелизСобран</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимаПередачаВФАП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БазыДляОбновления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаПодключения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Патчи/Ext/ObjectModule.bsl
/////////////// Защита модуля ///////////////
// @protect                                //
/////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
  Если ЭтоНовый() Тогда
    ЭтотОбъект.Дата = ТекущаяДатаСеанса();  
  КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
  ЭтотОбъект.ТекущийШаг = 0;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Релизы") Тогда
		Если Не ДанныеЗаполнения.РелизВыпущен И Не ДанныеЗаполнения.РелизСобран Тогда
			СтандартнаяОбработка = Ложь;
			Сообщить("Патч можно создать на основании собраного или выпущенного релиза");
			Возврат;
		КонецЕсли;
		
		НомерПоследнегоПатча = ПолучитьНомерПоследнегоПатча(ДанныеЗаполнения.Ссылка);
		
		РазбивкаВерсии = СтрРазделить(НомерПоследнегоПатча, ".");
		Если РазбивкаВерсии.Количество() <> 4 Тогда
			ВызватьИсключение "Не верный формат номера релиза";	
		КонецЕсли;
		
		ВерсияПатча = РазбивкаВерсии[РазбивкаВерсии.ВГраница()];
		РазбивкаВерсии.Удалить(РазбивкаВерсии.ВГраница());
		
		// Заполнение шапки
		УстановитьНовыйКод();
		Владелец = ДанныеЗаполнения.Ссылка;  
		Наименование = СтрСоединить(РазбивкаВерсии, ".") + "." + (Число(ВерсияПатча) + 1); 
		БазовыйНомерРевизии = ПолучитьПоследнююРевизию(?(ДанныеЗаполнения.РелизВыпущен, ДанныеЗаполнения.ДатаРелиза, ДанныеЗаполнения.ДатаНачала));
		
		Справочники.Патчи.ЗагрузитьБазовыеНаборыИзменений(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьНомерПоследнегоПатча(Релиз)
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЕСТЬNULL(Патчи.Наименование, Релизы.Наименование) КАК Наименование
	                |ИЗ
	                |	Справочник.Релизы КАК Релизы
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Патчи КАК Патчи
	                |		ПО (Патчи.Владелец = Релизы.Ссылка)
	                |ГДЕ
	                |	Релизы.Ссылка = &Релиз
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Наименование УБЫВ";
	
	Запрос.УстановитьПараметр("Релиз", Релиз);                            
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Наименование;
	КонецЕсли;
КонецФункции

Функция ПолучитьПоследнююРевизию(Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	БФТ_ИзмененияРепозитория.НомерРевизии КАК НомерРевизии
		|ИЗ
		|	РегистрСведений.БФТ_ИзмененияРепозитория КАК БФТ_ИзмененияРепозитория
		|ГДЕ
		|	БФТ_ИзмененияРепозитория.Период <= &Дата
		|	И НЕ БФТ_ИзмененияРепозитория.ИзменениеКонфигурации
		|
		|УПОРЯДОЧИТЬ ПО
		|	БФТ_ИзмененияРепозитория.НомерРевизии УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 Возврат ВыборкаДетальныеЗаписи.НомерРевизии;
	КонецЦикла;
КонецФункции


#КонецОбласти


#КонецЕсли
